let sizes = [
    {
        "t": "公众号封面大图",
        "s": "900 x 383 px",
        "r": "900:383"
    },
    {
        "t": "创意拼图、插画元素、艺术字",
        "s": "2000 x 2000 px",
        "r": "1:1"
    },
    {
        "t": "竖版拼图、手机壁纸、手机邀请函、手机海报、手机电商详情页、电商直播边框、动态海报、竖屏海报、视频海报、抖音/快手竖屏视频",
        "s": "1080 x 1920 px",
        "r": "9:16"
    },
    {
        "t": "手机海报、朋友圈邀请函、日签、竖版视频封面、视频边框、聊天背景图",
        "s": "1242 x 2208 px",
        "r": "9:16"
    },
    {
        "t": "Logo、方形二维码",
        "s": "600 x 600 px",
        "r": "1:1"
    },
    {
        "t": "社交拼图、视频封面",
        "s": "1600 x 1200 px",
        "r": "4:3"
    },
    {
        "t": "PPT演示文稿、电脑壁纸、游戏自介卡、横版 Banner、横版视频封面、视频字幕条、横屏海报、PPT 、横屏",
        "s": "1920 x 1080 px",
        "r": "16:9"
    },
    {
        "t": "社交拼图、Instagram 帖子、素材集合、方形配图、出海电商主图、饿了么商品主图、方形拼图、Instagram 方图",
        "s": "1080 x 1080 px",
        "r": "1:1"
    },
    {
        "t": "海报",
        "s": "424 x 574 mm",
        "r": "212:287"
    },
    {
        "t": "淘宝 Banner",
        "s": "608 x 304 px",
        "r": "2:1"
    },
    {
        "t": "公众号封面小图",
        "s": "200 x 200 px",
        "r": "1:1"
    },
    {
        "t": "长图海报",
        "s": "800 x 2000 px",
        "r": "2:5"
    },
    {
        "t": "DM 宣传单 A4",
        "s": "214 x 289 mm",
        "r": "214:289"
    },
    {
        "t": "名片、不干胶",
        "s": "94 x 58 mm",
        "r": "47:29"
    },
    {
        "t": "X 展架",
        "s": "804 x 1804 mm",
        "r": "201:451"
    },
    {
        "t": "三折页、二折页",
        "s": "289 x 214 mm",
        "r": "289:214"
    },
    {
        "t": "横版海报、横版二维码、作者名片",
        "s": "900 x 500 px",
        "r": "9:5"
    },
    {
        "t": "易拉宝",
        "s": "804 x 2004 mm",
        "r": "67:167"
    },
    {
        "t": "淘宝售后卡",
        "s": "104 x 144 mm",
        "r": "13:18"
    },
    {
        "t": "微信二维码",
        "s": "1240 x 620 px",
        "r": "2:1"
    },
    {
        "t": "微信朋友圈封面",
        "s": "1280 x 1184 px",
        "r": "40:37"
    },
    {
        "t": "视频封面",
        "s": "1440 x 900 px",
        "r": "8:5"
    },
    {
        "t": "淘宝方形 Banner",
        "s": "640 x 640 px",
        "r": "1:1"
    },
    {
        "t": "课程封面",
        "s": "800 x 500 px",
        "r": "8:5"
    },
    {
        "t": "贺卡",
        "s": "144 x 104 mm",
        "r": "18:13"
    },
    {
        "t": "菜单",
        "s": "424 x 289 mm",
        "r": "424:289"
    },
    {
        "t": "优惠券",
        "s": "184 x 64 mm",
        "r": "23:8"
    },
    {
        "t": "微博封面",
        "s": "980 x 300 px",
        "r": "49:15"
    },
    {
        "t": "方形海报、方形微信二维码",
        "s": "1500 x 1500 px",
        "r": "1:1"
    },
    {
        "t": "简历、宣传单、日常计划、考试反馈表、提案书、竖版 Worksheet、竖版授权书、Word 模板、日报简讯、竖版聘书奖状、信纸、A4 纸张、A4 简历模板",
        "s": "210 x 297 mm",
        "r": "70:99"
    },
    {
        "t": "DM宣传单 A5",
        "s": "144 x 214 mm",
        "r": "72:107"
    },
    {
        "t": "淘宝店铺招牌",
        "s": "950 x 120 px",
        "r": "95:12"
    },
    {
        "t": "电子贺卡、平板壁纸",
        "s": "2048 x 1536 px",
        "r": "4:3"
    },
    {
        "t": "手机截屏、邀请函、视频日签、视频邀请函、手机壁纸、每日一签",
        "s": "720 x 1280 px",
        "r": "9:16"
    },
    {
        "t": "微博焦点图",
        "s": "560 x 260 px",
        "r": "28:13"
    },
    {
        "t": "竖版名片、竖版不干胶",
        "s": "58 x 94 mm",
        "r": "29:47"
    },
    {
        "t": "邮件版头",
        "s": "800 x 267 px",
        "r": "800:267"
    },
    {
        "t": "礼品券",
        "s": "9.0 x 4.0 in",
        "r": "9:4"
    },
    {
        "t": "书籍封面",
        "s": "1563 x 2500 px",
        "r": "1563:2500"
    },
    {
        "t": "证书",
        "s": "11.0 x 8.5 in",
        "r": "11:8"
    },
    {
        "t": "明信片",
        "s": "5.8 x 4.1 in",
        "r": "5:4"
    },
    {
        "t": "专辑封面",
        "s": "1600 x 1600 px",
        "r": "1:1"
    },
    {
        "t": "门票",
        "s": "5.5 x 2.12 in",
        "r": "5:2"
    },
    {
        "t": "博客封面",
        "s": "750 x 500 px",
        "r": "3:2"
    },
    {
        "t": "Facebook 封面",
        "s": "851 x 315 px",
        "r": "851:315"
    },
    {
        "t": "英文邀请函",
        "s": "4.25 x 6.0 in",
        "r": "2:3"
    },
    {
        "t": "英文海报、竖版海报、A2 纸张、A2 海报",
        "s": "420 x 594 mm",
        "r": "70:99"
    },
    {
        "t": "英文菜单、信纸、流程单",
        "s": "8.5 x 11.0 in",
        "r": "8:11"
    },
    {
        "t": "X 帖子",
        "s": "1024 x 512 px",
        "r": "2:1"
    },
    {
        "t": "Facebook 帖子",
        "s": "940 x 788 px",
        "r": "235:197"
    },
    {
        "t": "Youtube 频道封面、YouTube 频道横幅",
        "s": "2560 x 1440 px",
        "r": "16:9"
    },
    {
        "t": "Google+封面",
        "s": "1240 x 700 px",
        "r": "62:35"
    },
    {
        "t": "X 封面",
        "s": "1500 x 500 px",
        "r": "3:1"
    },
    {
        "t": "Youtube 封面、在线会议背景",
        "s": "1280 x 720 px",
        "r": "16:9"
    },
    {
        "t": "英文名片",
        "s": "3.5 x 2.0 in",
        "r": "3:2"
    },
    {
        "t": "LinkedIn 背景图",
        "s": "1584 x 396 px",
        "r": "4:1"
    },
    {
        "t": "通栏广告",
        "s": "728 x 90 px",
        "r": "364:45"
    },
    {
        "t": "擎天广告",
        "s": "160 x 600 px",
        "r": "4:15"
    },
    {
        "t": "中尺寸广告",
        "s": "300 x 250 px",
        "r": "6:5"
    },
    {
        "t": "大尺寸广告",
        "s": "336 x 280 px",
        "r": "6:5"
    },
    {
        "t": "Facebook 广告",
        "s": "600 x 315 px",
        "r": "40:21"
    },
    {
        "t": "移动通栏广告",
        "s": "320 x 50 px",
        "r": "32:5"
    },
    {
        "t": "Pinterest 短帖",
        "s": "750 x 1120 px",
        "r": "75:112"
    },
    {
        "t": "ETSY 商店图标、LOGO 设计",
        "s": "500 x 500 px",
        "r": "1:1"
    },
    {
        "t": "ETSY 店铺封面",
        "s": "1200 x 300 px",
        "r": "4:1"
    },
    {
        "t": "标签",
        "s": "5.5 x 4.25 in",
        "r": "5:4"
    },
    {
        "t": "英文邮件版头、电子邮件标题、超链接配图",
        "s": "600 x 200 px",
        "r": "3:1"
    },
    {
        "t": "微信头像、头像",
        "s": "400 x 400 px",
        "r": "1:1"
    },
    {
        "t": "Facebook 活动封面、出海横版海报",
        "s": "1200 x 628 px",
        "r": "300:157"
    },
    {
        "t": "主图直通车、视频拼贴、方形海报、商品主图、主图图标、直播贴片、美团点评入口图、视频商品主图、淘宝主图、京东主图",
        "s": "800 x 800 px",
        "r": "1:1"
    },
    {
        "t": "手抄报、横版授权书、横版相册、横版聘书奖状、双折宣传册（A4横）",
        "s": "297 x 210 mm",
        "r": "99:70"
    },
    {
        "t": "社交晒图、社交拼图",
        "s": "1245 x 1660 px",
        "r": "3:4"
    },
    {
        "t": "透扇",
        "s": "180 x 180 mm",
        "r": "1:1"
    },
    {
        "t": "KT 板、A1 纸张、A1 海报",
        "s": "594 x 841 mm",
        "r": "594:841"
    },
    {
        "t": "印刷横版 Banner、横版应援手幅",
        "s": "456 x 156 mm",
        "r": "38:13"
    },
    {
        "t": "贴纸、方卡",
        "s": "100 x 100 mm",
        "r": "1:1"
    },
    {
        "t": "门头横版",
        "s": "1500 x 400 mm",
        "r": "15:4"
    },
    {
        "t": "专辑封面",
        "s": "1400 x 1400 px",
        "r": "1:1"
    },
    {
        "t": "展板",
        "s": "1000 x 500 mm",
        "r": "2:1"
    },
    {
        "t": "票根",
        "s": "70 x 140 mm",
        "r": "1:2"
    },
    {
        "t": "人生四格",
        "s": "50 x 150 mm",
        "r": "1:3"
    },
    {
        "t": "帆布包、抱枕",
        "s": "450 x 450 mm",
        "r": "1:1"
    },
    {
        "t": "飞盘、飞盘图案",
        "s": "272 x 272 mm",
        "r": "1:1"
    },
    {
        "t": "门票",
        "s": "170 x 55 mm",
        "r": "34:11"
    },
    {
        "t": "表盘壁纸",
        "s": "1079 x 1344 px",
        "r": "1079:1344"
    },
    {
        "t": "小卡、小卡边框",
        "s": "54 x 85 mm",
        "r": "54:85"
    },
    {
        "t": "海报横版",
        "s": "594 x 420 mm",
        "r": "99:70"
    },
    {
        "t": "易拉宝、2m易拉宝",
        "s": "800 x 2000 mm",
        "r": "2:5"
    },
    {
        "t": "名片（横版）",
        "s": "85 x 50 mm",
        "r": "17:10"
    },
    {
        "t": "印刷贺卡、明信片",
        "s": "148 x 105 mm",
        "r": "148:105"
    },
    {
        "t": "工作证",
        "s": "54 x 86 mm",
        "r": "27:43"
    },
    {
        "t": "二折页",
        "s": "426 x 291 mm",
        "r": "142:97"
    },
    {
        "t": "图表横版、横版配图、PPT",
        "s": "1024 x 768 px",
        "r": "4:3"
    },
    {
        "t": "漫画横版",
        "s": "250 x 200 mm",
        "r": "5:4"
    },
    {
        "t": "会议牌",
        "s": "210 x 100 mm",
        "r": "21:10"
    },
    {
        "t": "证件照竖版、1寸证件照",
        "s": "25 x 35 mm",
        "r": "5:7"
    },
    {
        "t": "名片竖版",
        "s": "50 x 85 mm",
        "r": "10:17"
    },
    {
        "t": "圆角名片",
        "s": "3.5 x 2 in",
        "r": "3:2"
    },
    {
        "t": "电子横版 Banner",
        "s": "1920 x 600 px",
        "r": "16:5"
    },
    {
        "t": "单图海报竖版",
        "s": "1200 x 1520 px",
        "r": "15:19"
    },
    {
        "t": "公众号标题、文章标题",
        "s": "1080 x 500 px",
        "r": "54:25"
    },
    {
        "t": "手机壳、定制手机壳",
        "s": "70 x 145 mm",
        "r": "14:29"
    },
    {
        "t": "T 恤",
        "s": "356 x 457 mm",
        "r": "356:457"
    },
    {
        "t": "邀请函横版",
        "s": "7 x 5 in",
        "r": "7:5"
    },
    {
        "t": "便签卡",
        "s": "5.5 x 4.3 in",
        "r": "5:4"
    },
    {
        "t": "贺卡竖版、A6 纸张",
        "s": "105 x 148 mm",
        "r": "105:148"
    },
    {
        "t": "旗帜横版、台历",
        "s": "210 x 140 mm",
        "r": "3:2"
    },
    {
        "t": "视频广告、Instagram 竖图",
        "s": "1080 x 1350 px",
        "r": "4:5"
    },
    {
        "t": "全屏海报",
        "s": "1284 x 2778 px",
        "r": "214:463"
    },
    {
        "t": "竖版海报",
        "s": "640 x 1008 px",
        "r": "40:63"
    },
    {
        "t": "宣传单、价目表",
        "s": "210 x 285 mm",
        "r": "14:19"
    },
    {
        "t": "印刷宣传海报、手账贴纸",
        "s": "420 x 570 mm",
        "r": "14:19"
    },
    {
        "t": "展板",
        "s": "1200 x 600 mm",
        "r": "2:1"
    },
    {
        "t": "方形不干胶",
        "s": "50 x 50 mm",
        "r": "1:1"
    },
    {
        "t": "不干胶",
        "s": "92 x 56 mm",
        "r": "23:14"
    },
    {
        "t": "名片、横版售后卡、标准名片",
        "s": "90 x 54 mm",
        "r": "5:3"
    },
    {
        "t": "横版菜单、相册书",
        "s": "420 x 297 mm",
        "r": "140:99"
    },
    {
        "t": "1.8m 展架",
        "s": "800 x 1800 mm",
        "r": "4:9"
    },
    {
        "t": "三折页",
        "s": "285 x 210 mm",
        "r": "19:14"
    },
    {
        "t": "课程封面",
        "s": "840 x 480 px",
        "r": "7:4"
    },
    {
        "t": "优惠券",
        "s": "180 x 54 mm",
        "r": "10:3"
    },
    {
        "t": "画册、超市 DM 单",
        "s": "420 x 285 mm",
        "r": "28:19"
    },
    {
        "t": "竖版台历",
        "s": "170 x 210 mm",
        "r": "17:21"
    },
    {
        "t": "会员卡",
        "s": "85 x 54 mm",
        "r": "85:54"
    },
    {
        "t": "门票",
        "s": "200 x 80 mm",
        "r": "5:2"
    },
    {
        "t": "手提袋",
        "s": "680 x 360 mm",
        "r": "17:9"
    },
    {
        "t": "小红书配图、图文带货、小红书套装、美图晒照、小红书封面图",
        "s": "1242 x 1660 px",
        "r": "621:830"
    },
    {
        "t": "文章长图",
        "s": "1080 x 1000 px",
        "r": "27:25"
    },
    {
        "t": "书单文案",
        "s": "1500 x 2000 px",
        "r": "3:4"
    },
    {
        "t": "网文封面",
        "s": "600 x 800 px",
        "r": "3:4"
    },
    {
        "t": "小程序分享图、小程序封面",
        "s": "520 x 416 px",
        "r": "5:4"
    },
    {
        "t": "抖音个人背景",
        "s": "1125 x 633 px",
        "r": "375:211"
    },
    {
        "t": "动态分割线",
        "s": "1080 x 200 px",
        "r": "27:5"
    },
    {
        "t": "条漫",
        "s": "1000 x 2500 px",
        "r": "2:5"
    },
    {
        "t": "动态引导关注",
        "s": "1080 x 300 px",
        "r": "18:5"
    },
    {
        "t": "竖版配图",
        "s": "1280 x 1920 px",
        "r": "2:3"
    },
    {
        "t": "竖版直播背景",
        "s": "1242 x 2690 px",
        "r": "621:1345"
    },
    {
        "t": "抖音团购图",
        "s": "2800 x 2100 px",
        "r": "4:3"
    },
    {
        "t": "电商详情页、详情关联",
        "s": "790 x 1000 px",
        "r": "79:100"
    },
    {
        "t": "出海竖版海报、商品主图、手机端店铺首页",
        "s": "750 x 1000 px",
        "r": "3:4"
    },
    {
        "t": "竖版商品主图、淘宝长图",
        "s": "800 x 1200 px",
        "r": "2:3"
    },
    {
        "t": "电商竖版海报",
        "s": "750 x 950 px",
        "r": "15:19"
    },
    {
        "t": "电商横版海报",
        "s": "750 x 390 px",
        "r": "25:13"
    },
    {
        "t": "美团点评轮播图",
        "s": "3200 x 1800 px",
        "r": "16:9"
    },
    {
        "t": "美团点评团单图、五连图",
        "s": "1600 x 900 px",
        "r": "16:9"
    },
    {
        "t": "胶囊 Banner",
        "s": "750 x 280 px",
        "r": "75:28"
    },
    {
        "t": "电商全屏海报",
        "s": "1920 x 700 px",
        "r": "96:35"
    },
    {
        "t": "弹窗广告",
        "s": "1440 x 2560 px",
        "r": "9:16"
    },
    {
        "t": "手机店铺首页",
        "s": "1200 x 1000 px",
        "r": "6:5"
    },
    {
        "t": "商品详情页",
        "s": "790 x 5000 px",
        "r": "79:500"
    },
    {
        "t": "美团店招",
        "s": "750 x 288 px",
        "r": "125:48"
    },
    {
        "t": "美团海报",
        "s": "720 x 240 px",
        "r": "3:1"
    },
    {
        "t": "美团商品主图、PPT 4:3",
        "s": "1440 x 1080 px",
        "r": "4:3"
    },
    {
        "t": "饿了么店招",
        "s": "1080 x 360 px",
        "r": "3:1"
    },
    {
        "t": "饿了么海报",
        "s": "686 x 176 px",
        "r": "343:88"
    },
    {
        "t": "竖版售后卡、竖版名片",
        "s": "54 x 90 mm",
        "r": "3:5"
    },
    {
        "t": "PPT 竖版",
        "s": "1125 x 2436 px",
        "r": "375:812"
    },
    {
        "t": "竖版工作证",
        "s": "54 x 85.5 mm",
        "r": "54:85"
    },
    {
        "t": "短视频模板",
        "s": "1242 x 2447 px",
        "r": "1242:2447"
    },
    {
        "t": "横版视频边框",
        "s": "2208 x 1242 px",
        "r": "16:9"
    },
    {
        "t": "警示贴纸、摩托车贴纸",
        "s": "630 x 855 mm",
        "r": "14:19"
    },
    {
        "t": "地贴",
        "s": "1200 x 1200 mm",
        "r": "1:1"
    },
    {
        "t": "手机全屏壁纸",
        "s": "1290 x 2796 px",
        "r": "215:466"
    },
    {
        "t": "手抄报",
        "s": "291 x 216 mm",
        "r": "97:72"
    },
    {
        "t": "红包封面",
        "s": "957 x 1278 px",
        "r": "319:426"
    },
    {
        "t": "Pad壁纸",
        "s": "2360 x 1640 px",
        "r": "59:41"
    },
    {
        "t": "手帐、A5 纸张、A5 书籍、A5 竖式宣传册",
        "s": "148 x 210 mm",
        "r": "74:105"
    },
    {
        "t": "动态表情包、表情包",
        "s": "240 x 240 px",
        "r": "1:1"
    },
    {
        "t": "贺卡、动态贺卡",
        "s": "140 x 210 mm",
        "r": "2:3"
    },
    {
        "t": "2寸证件照",
        "s": "35 x 49 mm",
        "r": "5:7"
    },
    {
        "t": "iWatch表盘背景",
        "s": "368 x 448 px",
        "r": "23:28"
    },
    {
        "t": "明信片",
        "s": "165 x 102 mm",
        "r": "55:34"
    },
    {
        "t": "手举牌",
        "s": "600 x 800 mm",
        "r": "3:4"
    },
    {
        "t": "红包",
        "s": "90 x 170 mm",
        "r": "9:17"
    },
    {
        "t": "竖版应援手幅",
        "s": "156 x 456 mm",
        "r": "13:38"
    },
    {
        "t": "书签",
        "s": "50 x 140 mm",
        "r": "5:14"
    },
    {
        "t": "相册书",
        "s": "594 x 210 mm",
        "r": "99:35"
    },
    {
        "t": "相册书",
        "s": "420 x 210 mm",
        "r": "2:1"
    },
    {
        "t": "书籍封面",
        "s": "170 x 240 mm",
        "r": "17:24"
    },
    {
        "t": "挂画",
        "s": "500 x 700 mm",
        "r": "5:7"
    },
    {
        "t": "8寸照片、6R 照片",
        "s": "152 x 203 mm",
        "r": "152:203"
    },
    {
        "t": "拼图",
        "s": "295 x 210 mm",
        "r": "59:42"
    },
    {
        "t": "定制T恤",
        "s": "300 x 330 mm",
        "r": "10:11"
    },
    {
        "t": "定制笔记本",
        "s": "280 x 210 mm",
        "r": "4:3"
    },
    {
        "t": "帆布袋",
        "s": "260 x 310 mm",
        "r": "26:31"
    },
    {
        "t": "定制抱枕",
        "s": "300 x 300 mm",
        "r": "1:1"
    },
    {
        "t": "便签",
        "s": "100 x 140 mm",
        "r": "5:7"
    },
    {
        "t": "口罩",
        "s": "180 x 130 mm",
        "r": "18:13"
    },
    {
        "t": "鼠标垫",
        "s": "240 x 200 mm",
        "r": "6:5"
    },
    {
        "t": "大号鼠标垫",
        "s": "600 x 300 mm",
        "r": "2:1"
    },
    {
        "t": "杯子",
        "s": "80 x 80 mm",
        "r": "1:1"
    },
    {
        "t": "方形5寸照片书",
        "s": "242 x 121 mm",
        "r": "2:1"
    },
    {
        "t": "方形6寸照片书",
        "s": "292 x 146 mm",
        "r": "2:1"
    },
    {
        "t": "方形8寸照片书",
        "s": "352 x 176 mm",
        "r": "2:1"
    },
    {
        "t": "竖版插画、图标",
        "s": "2000 x 3000 px",
        "r": "2:3"
    },
    {
        "t": "横版插画",
        "s": "3000 x 2000 px",
        "r": "3:2"
    },
    {
        "t": "竖版背景",
        "s": "3000 x 4000 px",
        "r": "3:4"
    },
    {
        "t": "横版背景",
        "s": "6000 x 3000 px",
        "r": "2:1"
    },
    {
        "t": "横版海报",
        "s": "1800 x 1000 px",
        "r": "9:5"
    },
    {
        "t": "小红书配图",
        "s": "1242 x 1656 px",
        "r": "3:4"
    },
    {
        "t": "公众号首图",
        "s": "1800 x 766 px",
        "r": "900:383"
    },
    {
        "t": "公众号次图",
        "s": "1000 x 1000 px",
        "r": "1:1"
    },
    {
        "t": "文章长图",
        "s": "1000 x 1500 px",
        "r": "2:3"
    },
    {
        "t": "PC 端店铺首页",
        "s": "1920 x 150 px",
        "r": "64:5"
    },
    {
        "t": "方形海报 1:1",
        "s": "1242 x 1242 px",
        "r": "1:1"
    },
    {
        "t": "张贴海报",
        "s": "426 x 576 mm",
        "r": "71:96"
    },
    {
        "t": "A0 纸张、A0 海报",
        "s": "841 x 1189 mm",
        "r": "1:1.41"
    },
    {
        "t": "A3 纸张、A3 海报",
        "s": "297 x 420 mm",
        "r": "1:1.41"
    },
    {
        "t": "B0 纸张",
        "s": "1000 x 1414 mm",
        "r": "1:1.41"
    },
    {
        "t": "B1 纸张、B1 海报",
        "s": "707 x 1000 mm",
        "r": "1:1.41"
    },
    {
        "t": "B2 纸张、B2 海报",
        "s": "500 x 707 mm",
        "r": "1:1.41"
    },
    {
        "t": "B5 纸张、B5 书籍",
        "s": "176 x 250 mm",
        "r": "1:1.42"
    },
    {
        "t": "C4 信封",
        "s": "229 x 324 mm",
        "r": "1:1.41"
    },
    {
        "t": "C5 信封",
        "s": "162 x 229 mm",
        "r": "1:1.41"
    },
    {
        "t": "C6 信封",
        "s": "114 x 162 mm",
        "r": "1:1.42"
    },
    {
        "t": "3R 照片",
        "s": "89 x 127 mm",
        "r": "7:5"
    },
    {
        "t": "4R 照片",
        "s": "102 x 152 mm",
        "r": "3:2"
    },
    {
        "t": "5R 照片",
        "s": "127 x 178 mm",
        "r": "7:5"
    },
    {
        "t": "8R 照片",
        "s": "203 x 254 mm",
        "r": "5:4"
    },
    {
        "t": "10R 照片",
        "s": "254 x 305 mm",
        "r": "6:5"
    },
    {
        "t": "12R 照片",
        "s": "305 x 381 mm",
        "r": "5:4"
    },
    {
        "t": "口袋书",
        "s": "111 x 178 mm",
        "r": "5:8"
    },
    {
        "t": "B6 书籍",
        "s": "125 x 176 mm",
        "r": "1:1.41"
    },
    {
        "t": "皇家书籍",
        "s": "156 x 234 mm",
        "r": "2:3"
    },
    {
        "t": "US Trade",
        "s": "152 x 229 mm",
        "r": "2:3"
    },
    {
        "t": "US Digest",
        "s": "139 x 215 mm",
        "r": "2:3"
    },
    {
        "t": "儿童正方书",
        "s": "203 x 203 mm",
        "r": "1:1"
    },
    {
        "t": "艺术大书",
        "s": "240 x 300 mm",
        "r": "4:5"
    },
    {
        "t": "小型海报、Tabloid 报纸",
        "s": "279 x 432 mm",
        "r": "11:17"
    },
    {
        "t": "中型海报",
        "s": "457 x 610 mm",
        "r": "18:24"
    },
    {
        "t": "大海报",
        "s": "610 x 914 mm",
        "r": "24:36"
    },
    {
        "t": "电影海报",
        "s": "686 x 1016 mm",
        "r": "27:40"
    },
    {
        "t": "广告牌",
        "s": "1016 x 1524 mm",
        "r": "40:60"
    },
    {
        "t": "明信片",
        "s": "100 x 148 mm",
        "r": "2:3"
    },
    {
        "t": "信纸（Letter）、三折宣传册（竖）、US Letter 简历模板",
        "s": "216 x 279 mm",
        "r": "8.5:11"
    },
    {
        "t": "Legal 纸",
        "s": "216 x 356 mm",
        "r": "8.5:14"
    },
    {
        "t": "Instagram 横图",
        "s": "1080 x 566 px",
        "r": "1.91:1"
    },
    {
        "t": "三折宣传册（横）",
        "s": "279 x 216 mm",
        "r": "13:10"
    },
    {
        "t": "A5 横式宣传册",
        "s": "210 x 148 mm",
        "r": "1.42:1"
    },
    {
        "t": "B站 视频封面",
        "s": "1146 x 717 px",
        "r": "16:10"
    },
    {
        "t": "微博长图",
        "s": "900 x 1600 px",
        "r": "9:16"
    },
    {
        "t": "京东详情页",
        "s": "750 x 2000 px",
        "r": "3:8"
    },
    {
        "t": "拼多多主图",
        "s": "750 x 750 px",
        "r": "1:1"
    },
    {
        "t": "小红书笔记封面",
        "s": "1080 x 1440 px",
        "r": "3:4"
    }
]

// 以 s为 key建一个字典，来排除重复的尺寸，但 t 需要合并（使用、合并，但 t要排重）
// const sizeMap = {};

// sizes.forEach(item => {
//   if (!sizeMap[item.s]) {
//     sizeMap[item.s] = {
//       t: new Set([item.t]),
//       r: item.r
//     };
//   } else {
//     sizeMap[item.s].t.add(item.t);
//   }
// });

// // 转换回数组格式
// sizes = Object.entries(sizeMap).map(([s, value]) => ({
//   t: Array.from(value.t).join('、'),
//   s,
//   r: value.r
// }));

// 全部单位转成 px（cm,mm,in 转成 px），计算出最大尺寸和最小尺寸
// function parseSizeString(sizeStr, dpi = 96, defaultSize = 1000) {
//     // 移除所有空格,这样就能同时处理有空格和无空格的情况
//     const cleanStr = sizeStr.replace(/\s+/g, '');
//     const match = /([\d.]+)x([\d.]+)(cm|mm|inch|in|px)?/.exec(cleanStr);
//     let width, height;
  
//     if (match) {
//       let [_, w, h, unit] = match;
//       width = parseFloat(w);
//       height = parseFloat(h);
//       unit = unit || 'px';
  
//       // 先转换成像素
//       switch (unit) {
//         case "inch":
//         case "in":
//           // 1英寸 = 96像素
//           width = width * dpi; // 3.5 * 96 = 336
//           height = height * dpi; // 2.0 * 96 = 192
//           break;
//         case "cm":
//           // 1厘米 = 37.8像素
//           width *= dpi / 2.54;
//           height *= dpi / 2.54;
//           break;
//         case "mm":
//           // 1毫米 = 3.78像素
//           width *= dpi / 25.4;
//           height *= dpi / 25.4;
//           break;
//         case "px":
//           // 保持不变
//           break;
//       }
  
//       return {
//         targetWidth: Math.round(width),
//         targetHeight: Math.round(height)
//       };
//     }
  
//     // fallback 情况下使用 defaultSize
//     const [w, h] = cleanStr.split(/[x*]/).map(Number);
//     return {
//       targetWidth: isNaN(w) ? defaultSize : w,
//       targetHeight: isNaN(h) ? defaultSize : h,
//     };
//   }

// let maxSize = 0;
// let minSize = Infinity;

// sizes.forEach(item => {
//     const { targetWidth, targetHeight } = parseSizeString(item.s);
//     if (targetWidth > maxSize) {
//         maxSize = targetWidth;
//     }
//     if (targetHeight > maxSize) {
//         maxSize = targetHeight;
//     }
//     if (targetHeight < minSize) {
//         minSize = targetHeight;
//     }
//     if (targetWidth < minSize) {
//         minSize = targetWidth;
//     }
// });

// console.log(maxSize, minSize);

export default sizes;
